# Задачи по программированию на C и C++
Сборник задач по программированию для начинающих.

## Не отсортированное
1. Отметьте крестиком `[x]` правильное написание заголовка, и выведите результат на экран:
    ```
    [] #include <iostream>;
    [] #includ <iostream>
    [] #include <iostream>
    [] #include <iostrem>
    ```
1. Отметьте крестиком `[x]` правильное написание пространства имен, и выведите результат на экран:
    ```
    [] use namespace std;
    [] using namespace std;
    [] using namespacing std;
    [] uses namespace std;
    ```
1. Напишите программу, которая запрашивает два целых числа, и выводит их в обратном порядке через пробел.
    
    **Пример:**
    
    *Пользователь вводит:*
    ```
    1 2
    ```
    *Программа выводит:*
    ```
    2 1
    ```
1. Напишите программу, которая запрашивает четыре целых числа и выводит их в обратном порядке по одному в строке.
    
    **Пример:**
    
    *Пользователь вводит:*
    ```
    1 2 3 4
    ```
    *Программа выводит:*
    ```
    4
    3
    2
    1
    ```
1. Напишите программу, которая запрашивает три цифры (от 0 до 9) и выводит число, получающееся из этих цифр в том же порядке, что и при вводе.
    
    **Пример 1:**
    
    *Пользователь вводит:*
    ```
    1 2 3
    ```
    *Программа выводит:*
    ```
    123
    ```
    
    **Пример 2:**
    
    *Пользователь вводит:*
    ```
    0 1 2
    ```
    *Программа выводит:*
    ```
    12
    ```
1. Напишите программу, которая запрашивает пять целых чисел и выводит:
    * в первой строке - сумму первых двух чисел, 
    * во второй строке - сумму первых трёх чисел, 
    * в третьей строке - сумму первых четырёх чисел, 
    * в четвёртой строке - сумму всех пяти чисел.

    **Пример:**
    
    *Пользователь вводит:*
    ```
    1 2 3 4 5
    ```
    *Программа выводит:*
    ```
    3
    6
    10
    15
    ```
1. Напишите программу, которая запрашивает три различные цифры (кроме 0) в порядке возрастания и выводит все возможные трёхзначные числа, которые можно составить из этих цифр. Числа должны быть выстроены по возрастанию.
    
    **Пример 1:**
    
    *Пользователь вводит:*
    ```
    1 2 3
    ```
    *Программа выводит:*
    ```
    123
    132
    213
    231
    312
    321
    ```
    
    **Пример 2:**
    
    *Пользователь вводит:*
    ```
    2 7 9
    ```
    *Программа выводит:*
    ```
    279
    297
    729
    792
    927
    972
    ```
1. Отметьте крестиком `[x]` варианты с корректными объявлениями и присваиваниями, и выведите результат на экран:
    ```
    [] char symbol = 'c';
    [] int k = 2, b, c=-4;
    [] double x = 17.32, y, z = 1;
    [] int a, b = 0;
    [] int b = 1
    [] char sym = '2';
    [] char symbol = k;
    ```
1. Расставьте строки программы так, чтобы получилась синтаксически правильная программа, после выполнения которой в переменной x будет значение 10, а в переменной y значение 100.
    ```
    x=100;
    int main (void) {
    }
    return 0;
    x = 10;
    y = x;
    int x=0, y=0;
    #include <stdio.h>
    ```

## Вывод текста на экран
1. Расставьте строки в правильном порядке, чтобы получилась рабочая программа.
    ```
    printf("Hello, World!");
    #include <stdio.h>
    return 0;
    }
    int main(void) {
    ```
1. Выведите на экран текст:
    ```
    Hello, World!
    The world is yours!
    ```
1. Выведите на экран текст, сохраняя пустые строки между текстом:
    ```
    Wake up, Neo...

    The Matrix has you...

    Follow the white rabbit...
    ```
1. Выведите на экран текст, выравнив правую колонку:
    ```
    NICKNAME:   Neo
    CITY:       New-York
    AGE:        35
    HEIGHT:     180
    WEIGHT:     75
    ```
1. Выведите на экран флаг США:
    ```
    _______________________________________________________________________________
    *   *   *   *   *   * _________________________________________________________
      *   *   *   *   *   _________________________________________________________
    *   *   *   *   *   * _________________________________________________________
      *   *   *   *   *   _________________________________________________________
    *   *   *   *   *   * _________________________________________________________
      *   *   *   *   *   _________________________________________________________
    *   *   *   *   *   * _________________________________________________________
      *   *   *   *   *   _________________________________________________________
    *   *   *   *   *   * _________________________________________________________
    _______________________________________________________________________________
    _______________________________________________________________________________
    _______________________________________________________________________________
    _______________________________________________________________________________
    ```
## Типы данных
1. Типы данных и значения перепутались. 
    Переставьте значения в соответствии с их типами, и выведите результат на экран:
    ```
    double     1861
    char       3.187236
    int        d
    ```
1. Отметьте крестиком `[x]` варианты, для которых лучше использовать тип `int` *(целые числа)*, и выведите результат на экран:
    ```
    [] количество букв в слове
    [] произведение двух целых чисел
    [] стоимость товара
    [] результат деления одного целого числа на другое
    [] количество посетителей страницы сайта за сутки
    [] сумма двух чисел
    [] значения корней квадратного уравнения
    [] вес человека (кг), полученный с электронных напольных весов
    [] текущий год
    [] значение числа Пи
    [] первая буква английского алфавита
    ```
1. Отметьте крестиком `[x]` варианты, для которых лучше использовать тип `double` или `float` *(числа с плавающей запятой)*, и выведите результат на экран:
    ```
    [] уровень IQ человека
    [] вес человека (кг), полученный с электронных напольных весов
    [] количество книг в библиотеке
    [] слово "программирование"
    [] вес человека (кг), полученный с механических напольных весов
    [] первая буква английского алфавита
    [] сумма двух целых чисел
    [] текущий год
    [] результат деления одного целого числа, на другое
    [] значение числа Пи
    [] произведение двух целых чисел
    ```

##  Переменные
1. Отметьте крестиком `[x]` правильные имена переменных, и выведите результат на экран:
    ```
    [] IP-4
    [] name
    [] proizvedenie2
    [] m4
    [] pi
    [] 0simvol
    [] summa_a_b
    [] determinant
    [] key_pressed
    [] PRICE
    [] 4you
    [] $team
    [] #name
    [] resultPrice
    [] bestDayOfMyLife
    ```
1. Отметьте крестиком `[x]` неправильные имена переменных, и выведите результат на экран:
    ```
    [] 2number
    [] telephone
    [] line-2
    [] apple
    [] mac-address
    [] l
    [] peremennay
    [] x
    [] region98
    [] i
    [] USA
    [] R_F
    [] You_Tube_
    [] _privateVariable
    ```
1. Объявления переменных и их комментарии перепутались. 
    Переставьте комментарии в соответствии с объявлениями, и выведите результат на экран:
    ```
    int N;          // объявление двух целочисленных переменных
    double x,y;     // объявление целочисленной переменной
    int x, y;       // объявление переменной символьного типа
    char symbol;    // объявление двух вещественных переменных
    ```
1. Отметьте крестиком `[x]` объявления переменных с ошибками, и выведите результат на экран:
    ```
    [] integer v;
    [] double: q, w;
    [] int a, b, c;
    [] x, y, z int;
    [] int x, y z;
    [] double mm.
    [] int a, float b;
    [] char a; 
    ```
1. Часть кода стерлась.
    Допишите код до рабочего состояния:
    ```
    #include <stdio.h>
    main (void) {
        secretVariable;
        scanf("%d", secretVariable);
        printf("Вы ввели: %d", secretVariable);
        (0);
    }
    ```
